Repository: javiervicoegea/pgMulti
Catalog: PgMulti/Properties/Text.*.resx
Languages: es

# basic_parse_error
source: The script cannot be executed because the parser is not able to individualize the commands that comprise it.
es: La secuencia de comandos no se puede ejecutar porque el analizador sintáctico no es capaz de individualizar los comandos que la componen.

# line_column
source: Line {0}, position {1}
es: Línea {0}, columna {1}

source: Show closed tabs
es: Mostrar las solapas cerradas

source: Reopen selected tab
es: Reabrir solapa seleccionada

source: Closed tabs log
es: Historial de solapas cerradas

# warning_no_table_selected
source: You must select at least one table
es: Debe seleccionar al menos una tabla

source: Select tables
es: Seleccionar tablas

# pgdx_file_filter
source: pgMulti diagram PGDX files (*.pgdx)|*.pgdx|All files|*.*
es: Ficheros PGDX de diagramas de pgMulti (*.pgdx)|*.pgdx|All files|*.*

# warning_bad_format_diagram_file
source: The file is not a valid pgMulti diagram
es: El fichero no es un diagrama de pgMulti válido

# diagram_title
source: {0} - pgMulti diagram
es: {0} - Diagrama de pgMulti

source: Add tables
es: Añadir tablas

source: New diagram
es: Nuevo diagrama

source: Open diagram
es: Abrir diagrama

source: Diagrams
es: Diagramas

source: Check updates
es: Comprobar actualizaciones

source: Update available
es: Actualización disponible
