Repository: javiervicoegea/pgMulti
Catalog: PgMulti/Properties/Text.*.resx
Languages: es

source: About...
es: Acerca de...

source: All databases
es: Todas las bases de datos

# all_tasks_finished
source: All tasks have finished successfully
es: Todas las tareas han terminado correctamente

source: Apply changes
es: Aplicar cambios

source: App options
es: Opciones de la aplicación

source: Attributions
es: Atribuciones

source: Author
es: Autor

# automatic_begin_transaction
source: TRANSACTION {0} AUTOMATICALLY STARTED
es: TRANSACCIÓN {0} INICIADA AUTOMÁTICAMENTE

# auto_coordinated_transactions
source: Coordinated automatic transactions
es: Transacciones automáticas coordinadas

source: Auto scroll
es: Scroll automático

# auto_single_transactions
source: Single automated transactions
es: Transacciones automáticas independientes

# back
source: Go back
es: Atrás

# btn_cancel
source: &Cancel
es: &Cancelar

# btn_ok
source: &OK
es: &Aceptar

# btn_reset
source: &Reset
es: &Restablecer

# btn_test
source: &Test
es: &Probar

source: CANCELING ALL TASKS
es: CANCELANDO TODAS LAS TAREAS

# cannot_determine_with_statement
source: Could not determine the type of statement beginning with WITH
es: No se ha podido determinar el tipo de sentencia que empieza con WITH

# change_pass
source: Change password
es: Cambiar contraseña

source: child table
es: tabla secundaria

source: Close
es: Cerrar

# closed_connection
source: CONNECTION CLOSED
es: CONEXIÓN CERRADA

source: Close all
es: Cerrar todo

source: Close all tabs
es: Cerrar todas las solapas

source: Close all tabs except this one
es: Cerrar todas las solapas menos esta

source: Close this tab
es: Cerrar esta solapa

source: Collapse all
es: Contraer todo

source: Columns
es: Columnas

# commited_coordinated_auto_transaction
source: TRANSACTION COMMITED AUTOMATICALLY AND COORDINATELY
es: TRANSACCIÓN CONFIRMADA AUTOMÁTICA Y COORDINADAMENTE

# commited_single_auto_transaction
source: AUTOMATICALLY AND INDIVIDUALLY CONFIRMED TRANSACTION
es: TRANSACCIÓN CONFIRMADA AUTOMÁTICA E INDIVIDUALMENTE

# completed_in
source: Completed in {0}
es: Completado en {0}

# completed_statement_n_in_all_tasks
source: Completed query {0} in all tasks
es: Completada la consulta {0} en todas las tareas

# confirm_close
source: File {0} contains unsaved changes. Do you want to save it now?
es: El fichero {0} contiene cambios sin guardar. ¿Desea guardarlo ahora?

# confirm_close_all
source: There are modified files that have not been saved. If you continue, you will lose the changes you made.
es: Hay ficheros modificados que no se han guardado. Si continúa, perderá los cambios realizados.

# confirm_execution
source: Confirm query execution
es: Confirmar ejecución de comandos

# confirm_remove
source: Confirm deletion
es: Confirmar eliminación

# confirm_remove_db
source: Are you sure you want to remove database '{0}'?
es: ¿Confirmas que quieres eliminar la base de datos '{0}'?

# confirm_remove_group
source: Are you sure you want to delete the database group '{0}'? ATTENTION: Databases within the group will also be deleted.
es: ¿Confirmas que quieres eliminar el grupo de bases de datos '{0}'? ATENCIÓN: Se eliminarán también las bases de datos dentro del grupo.

# confirm_stop_all
source: Are you sure you want to stop all running tasks?
es: ¿Estás seguro de que quieres detener todas las tareas en ejecución?

# confirm_stop_selected
source: Are you sure you want to stop the selected tasks?
es: ¿Estás seguro de que quieres detener las tareas seleccionadas?

source: CONNECTION OPENED
es: CONEXIÓN ABIERTA

# connection_opened_to
source: CONNECTION OPENED TO {0}
es: CONEXIÓN ABIERTA A {0}

# copy_sc
source: Copy (ctrl + c)
es: Copiar (ctrl + c)

# csv_file_filter
source: CSV files (*.csv)|*.csv|All files|*.*
es: Ficheros CSV (*.csv)|*.csv|Todos los archivos|*.*

# csv_task
source: CSV export task
es: Tarea exportación CSV

# cut_sc
source: Cut (ctrl + x)
es: Cortar (ctrl + x)

# db
source: Database
es: Base de datos

# db_field_name
source: Database
es: Base de datos

source: Delay
es: Retraso

# delete_rows
source: Remove selected rows
es: Borrar filas seleccionadas

# down
source: Move down
es: Bajar

source: Edit
es: Editar

# edit_db
source: Edit database
es: Editar base de datos

source: Edit selected script
es: Editar script seleccionado

# enable_autocomplete
source: Enable automatic autocomplete suggestions
es: Activar sugerencias automáticas

# error_count
source: {0} errors
es: {0} errores

# error_in_task
source: ERROR IN TASK {0}
es: ERROR EN TAREA {0}

# error_no_manual_transaction_allowed_in_auto_transactions
source: ERROR: BEGIN, COMMIT and ROLLBACK commands are not supported in automatic transaction modes
es: ERROR: No se admiten los comandos BEGIN, COMMIT ni ROLLBACK en los modos de transacción automática

# error_opening_file
source: An error occurred while trying to open the file in
es: Se produjo un error al intentar abrir el archivo en

# error_saving
source: An error occurred trying to save the application state. If you close the application, you will lose the content of the open tabs that you have not saved.
es: Se produjo un error intentando guardar el estado de la aplicación. Si la cierras, perderás el contenido de las solapas abiertas que no hubieras guardado.

# error_saving_file
source: An error occurred while trying to save the file to
es: Se produjo un error al intentar guardar el archivo en

# executed_in_comment
source: -- EXECUTED IN {0}
es: -- EJECUTADO EN {0}

# executed_query
source: Query executed
es: Consulta ejecutada

# executing_since
source: RUNNING SINCE
es: EN EJECUCIÓN DESDE

# execution_log
source: Log of executed commands
es: Historial de comandos ejecutados

source: Explore table
es: Explorar tabla

# explore_table_x
source: Explore table {0}
es: Explorar tabla {0}

# export_csv
source: Run query and export results in CSV file
es: Ejecutar consulta y exportar resultados en fichero CSV

source: File
es: Archivo

# find_sc
source: Find (ctrl + f)
es: Buscar (ctrl + f)

# finished_error
source: finished with ERROR
es: terminado con ERROR

# finished_successfully
source: successfully finished
es: terminado correctamente

# format_sc
source: Format (ctrl + d)
es: Dar formato (ctrl + d)

# forward
source: Go forward
es: Adelante

# goto_sc
source: Go to line... (ctrl + g)
es: Ir a la línea... (ctrl + g)

# history
source: Log
es: Historial

# incompatible_queries
source: The script contains different queries whose results are incompatible with each other and cannot be exported to the same CSV file
es: El script contiene diferentes consultas cuyos resultados son incompatibles entre sí y no se pueden exportar a un mismo fichero CSV

# incompatible_query
source: Statement no. {0} cannot be integrated because it does not have the same number of fields or they do not match
es: La sentencia nº {0} no se puede integrar porque no tiene el mismo número de campos o estos no coinciden

# increase_font
source: Increase font size
es: Aumentar tamaño de la letra

source: Initializing
es: inicializando

# insert_in
source: Insert in {0}
es: Insertar en {0}

source: Insert row
es: Insertar fila

# keep_db_selection
source: Keep selected databases between runs
es: Mantener las bases de datos seleccionadas entre ejecuciones

source: Language
es: Idioma

source: Level
es: Nivel

source: Limit
es: Límite

source: Manual scroll
es: Scroll manual

source: Manual transactions
es: Transacciones manuales

# max_rows
source: Row limit per table
es: Límite de filas por tabla

# mergeTables
source: Merge result tables
es: Combinar tablas de resultados

source: Mode
es: Modo

# modifications_in
source: Modifications in {0}
es: Modificaciones en {0}

source: More options
es: Más opciones

source: Name
es: Nombre

# new_doc_title
source: Untitled
es: Sin título

source: New group
es: Nuevo grupo

source: New password
es: Nueva contraseña

source: No errors
es: Sin errores

# no_results
source: The query returned no results
es: La consulta no devolvió resultados

# no_selected_rows
source: You have not selected any rows. To select a row, you must click on the button to the left of the corresponding row.
es: No ha seleccionado ninguna fila. Para seleccionar una fila, debe hacer click en el botón a la izquierda de la fila correspondiente.

source: NULL value
es: Valor NULL

# n_affected_rows
source: {0} affected rows
es: {0} filas afectadas

source: Open
es: Abrir

source: Options
es: Opciones

source: parent table
es: tabla principal

source: Password
es: Contraseña

# paste_sc
source: Paste (ctrl + v)
es: Pegar (ctrl + v)

# pg_error_code
source: PostgreSQL error code
es: Código de error de PostgreSQL

# pg_exception_detail
source: Exception detail
es: Detalle de la excepción

source: Port
es: Puerto

# prepared_coordinated_auto_transaction
source: TRANSACTION READY FOR COMMIT WITH ID {0}
es: TRANSACCIÓN PREPARADA PARA LA CONFIRMACIÓN CON ID {0}

# query_counter
source: QUERY Nº {0} OF {1} - LINE {2}
es: CONSULTA Nº {0} DE {1} - LÍNEA {2}

# redo_sc
source: Redo (ctrl + y)
es: Rehacer (ctrl + y)

# reduce_font
source: Reduce font size
es: Reducir tamaño de la letra

source: Refresh
es: Actualizar

source: Relations
es: Relaciones

# relation_type
source: {0} relation
es: Relación {0}

source: Remove
es: Eliminar

# remove_completed
source: Clear all completed results
es: Borrar todos los resultados completados

# remove_selected
source: Clear selected completed results
es: Borrar los resultados completados seleccionados

source: Repeat password
es: Repite contraseña

# replace_sc
source: Replace (ctrl + r)
es: Reemplazar (ctrl + r)

# reset_confirm_message
source: If you reset the password, you will lose all application settings. Are you sure you want to reset the password?
es: Si restablece la contraseña, perderá toda la configuración de la aplicación. ¿Está seguro de que quiere restablecer la contraseña?

# reset_confirm_title
source: Reset password
es: Restablecer contraseña

source: Result
es: Resultado

# rollbacked_coordinated_auto_transaction
source: AUTOMATICALLY AND COORDINATELY REVERSED TRANSACTION
es: TRANSACCIÓN REVERTIDA AUTOMÁTICA Y COORDINADAMENTE

# rollbacked_prepared_transaction
source: Reverted transaction being ready for commit
es: Transacción revertida estando preparada para la confirmación

# rollbacked_single_auto_transaction
source: AUTOMATICALLY REVERSED TRANSACTION
es: TRANSACCIÓN REVERTIDA AUTOMÁTICAMENTE

# rows_limit_warning
source: or more ({0} is the limit)
es: o más ({0} es el límite)

# rows_limit_warning_short
source: (first {0} rows only)
es: (solo primeras {0} filas)

source: running
es: ejecutando

source: Run all
es: Ejecutar todo

# run_all_extended
source: Run all scripts on their respective databases
es: Ejecutar todos los scripts en sus respectivas bases de datos

# run_on
source: Run on {0} databases
es: Ejecutar en {0} bases de datos

source: Save
es: Guardar

# saved_rows
source: Total rows saved
es: Total de filas guardadas

source: Save all
es: Guardar todo

source: Save as...
es: Guardar como...

source: Saving row
es: Guardando fila

# script_count_message
source: A total of {0} scripts will be executed
es: Se ejecutarán un total de {0} scripts

# script_index_message
source: Script {0}/{1} to be executed in {2}
es: Script {0}/{1} a ejecutar en {2}

# select_open_file
source: Select the file to open
es: Seleccione el archivo a abrir

# select_save_file
source: Select where to save the file
es: Seleccione donde guardar el archivo

# select_to_set_null_value
source: Select to indicate the NULL value
es: Seleccionar para indicar el valor NULL

source: Server
es: Servidor

# setup_config
source: Initialize configuration
es: Inicializar configuración

source: Set NULL
es: Establecer a NULL

# show_text_window
source: View in text window
es: Ver en ventana de texto

# sql_file_filter
source: SQL files (*.sql)|*.sql|All files|*.*
es: Ficheros SQL (*.sql)|*.sql|Todos los archivos|*.*

# pgcx_file_filter
source: pgMulti connection export PGCX files (*.pgcx)|*.pgmx|All files|*.*
es: Ficheros PGCX de exportación de conexiones de pgMulti (*.pgcx)|*.pgcx|Todos los archivos|*.*

source: Starting tasks
es: Iniciando tareas

# statement_n
source: Query no. {0}
es: Consulta nº {0}

# stop_all
source: Stop all tasks
es: Detener todas las tareas

# stop_selected
source: Stop selected tasks
es: Detener tareas seleccionadas

source: Syntax error
es: Error de sintaxis

source: Table
es: Tabla

# tasks_finished_with_error
source: All tasks have finished but errors occurred
es: Todas las tareas han terminado pero se produjeron errores

# task_in
source: Task in {0}
es: Tarea en {0}

# task_integrator
source: INTEGRATOR TASK
es: TAREA INTEGRADORA

# test_error_title
source: Failed to test connection
es: Error al probar conexión

# test_successful_message
source: The connection to the server has been established successfully
es: La conexión con el servidor se ha establecido correctamente

# test_successful_title
source: successful connection
es: Conexión correcta

source: Text
es: Texto

# tip
source: Suggestion
es: Sugerencia

# tip_content_no_selected_db
source: If you activate a database, it will also show options to autocomplete schemas, tables, columns and joins
es: Si activa una base de datos, también se mostrarán opciones para autocompletar esquemas, tablas, columnas y joins

# tip_title_no_selected_db
source: No database selected
es: No hay base de datos seleccionada

source: Total duration
es: Duración total

# total_rows
source: Total rows fetched
es: Total de filas obtenidas

# total_rows_integrated_in_statement_n
source: Total rows built into query {0}
es: Total de filas integradas en consulta {0}

source: Transactions
es: Transacciones

# undo_sc
source: Undo (ctrl + z)
es: Deshacer (ctrl + z)

# up
source: Move up
es: Subir

source: User
es: Usuario

# waiting_coordinated_commit
source: Task {0} waiting for coordinated commit
es: Tarea {0} esperando confirmación coordinada

# waiting_tasks
source: Waiting for the rest of the tasks...
es: Esperando al resto de tareas...

source: Warning
es: Atención

# warning_duplicate_alias
source: There is already a database with the same name
es: Ya hay una base de datos con el mismo nombre

# warning_empty_alias
source: The name field cannot be blank
es: El campo nombre no puede estar en blanco

# warning_empty_db
source: The database field cannot be blank
es: El campo base de datos no puede estar en blanco

# warning_empty_password
source: The password field cannot be blank
es: El campo contraseña no puede estar en blanco

# warning_empty_port
source: The port field cannot be blank
es: El campo puerto no puede estar en blanco

# warning_empty_query
source: The SQL query to execute cannot be blank
es: La consulta SQL a ejecutar no puede estar en blanco

# warning_empty_server
source: The server field cannot be blank
es: El campo servidor no puede estar en blanco

# warning_empty_user
source: The user field cannot be blank
es: El campo usuario no puede estar en blanco

# warning_invalid_autocomplete_delay
source: The autocomplete suggestions delay entered is not correct
es: El retraso de las sugerencias automáticas introducido no es correcto

# warning_invalid_max_rows
source: The entered limit of rows per table is not correct
es: El límite de filas por tabla introducido no es correcto

# warning_invalid_password
source: The password is not correct
es: La contraseña no es correcta

# warning_invalid_port
source: The port field must be a valid port number
es: El campo puerto debe ser un número de puerto válido

# warning_no_selected_dbs
source: You must select at least one database on which to execute the SQL query
es: Hay que seleccionar al menos una base de datos en la que ejecutar la consulta SQL

# warning_password_mismatch
source: Passwords do not match
es: Las contraseñas no coinciden

# warning_password_null
source: Password cannot be null
es: La contraseña no puede ser nula

# warning_password_too_short
source: Password is too short (must be at least 6 characters)
es: La contraseña es demasiado corta (debe tener al menos 6 caracteres)

# warning_runnig_tasks
source: The application cannot be closed while there are queries running. If necessary, stop them first.
es: No se puede cerrar la aplicación mientras hay consultas en ejecución. Si es necesario, detenlas primero.

source: New
es: Nuevo

# keep_db_selection_explanation
source: If this option is not enabled, running the entered SQL commands will reset the database selection, requiring you to select them again the next time you run commands. This can prevent oversights and executions on unwanted servers.
es: Si esta opción no está activada, al ejecutar los comandos SQL introducidos, se reiniciará la selección de bases de datos, lo que requerirá que vuelva a seleccionarlas de nuevo la próxima vez que ejecute comandos. Esto puede evitar descuidos y ejecuciones en bases de datos no deseadas.

# autocomplete_explanation
source: The autocomplete function displays suggestions as you type SQL code. You can change the time it takes for suggestions to display, or you can turn them off so they don't appear automatically. Whether they are enabled or not, you can always unhide them manually by pressing the ctrl + space key combination.
es: La función autocompletar muestra sugerencias mientras escribe código SQL. Puede cambiar el tiempo que tardan en mostrarse las sugerencias o puede desactivarlas para que no aparezcan automáticamente. Estén o no activadas, siempre puede mostrarlas manualmente pulsando la combinación de teclas ctrl + espacio.

# merge_tables_explanation
source: If you enable this option and run a query against multiple databases simultaneously, the result tables will be merged into a single table, which will include a new column with the name of the database each row came from.
es: Si activa esta opción y ejecuta una consulta en varias bases de datos simultáneamente, las tablas de resultados se integrarán en una única tabla, que incluirá una nueva columna con el nombre de la base de datos de la que procede cada fila.

# max_rows_explanation
source: To avoid excessive use of RAM and overloading the server, the number of rows displayed in this application when a SELECT query is executed is limited to the number indicated in the following field. Normally 100 rows is more than enough. If you need a larger number, you should probably add other conditions in the WHERE clause. However, you can edit this limit if you want. Note: This limit does not affect CSV export of results, in which case all rows are always included.
es: Para evitar un uso excesivo de RAM y sobrecargar el servidor, el número de filas que se muestran en esta aplicación cuando se ejecuta una consulta SELECT está limitado al número que se indica en el siguiente campo. Normalmente 100 filas es más que suficiente. Si necesita un número mayor, probablemente debería añadir otras condiciones en la cláusula WHERE. No obstante, puede editar este límite si lo desea. Nota: este límite no afecta a la exportación de resultados en CSV, en cuyo caso siempre se incluyen todas las filas.

# auto_coordinated_transaction_mode_explanation
source: The entire script is automatically executed in a single transaction for each of the selected databases. Unlike the previous option, transactions for all connections are coordinated using PostgreSQL's two-phase commit mechanism. This ensures with a high probability that all of them behave atomically, as a single global transaction. That is, either the script is committed in all the databases, or they all remain in the same state prior to execution. To use this mode, you must configure the max_prepared_transactions parameter of the server and it will need to be restarted.
es: Todo el script se ejecuta automáticamente en una única transacción para cada una de las bases de datos seleccionadas. A diferencia de la opción anterior, la transacciones de todas las conexiones se coordinan mediante el mecanismo de confirmación en dos fases de PostgreSQL. Esto asegura con una alta probabilidad que todas ellas se comporten atómicamente, como una única transacción global. Es decir, o el script se confirma en todas las bases de datos, o todas quedan en el mismo estado previo a la ejecución. Para usar esta modalidad, debe configurar el parámetro max_prepared_transactions del servidor y será necesario reiniciarlo.

# auto_single_transaction_mode_explanation
source: The entire script is automatically executed in a single transaction for each of the selected databases. In the event of an error during the execution of any command in a database, all changes in that database will be automatically rolled back, without affecting its execution in other databases, if any.
es: Todo el script se ejecuta automáticamente en una única transacción para cada una de las bases de datos seleccionadas. En caso de error durante la ejecución de cualquier comando en una base de datos, todos los cambios en esa base de datos se revertirán automáticamente, sin afectar a su ejecución en otras bases de datos, si los hay.

# manual_transaction_mode_explanation
source: Each query in the script will execute in a separate transaction, unless it includes the BEGIN, COMMIT, and ROLLBACK commands, in which case it will execute as expected. Unlike other tools, this application does not reuse the connection between different executions, which means that you cannot continue a transaction started in a previous execution. Any transaction you initiate, you must commit in the same text or it will be automatically rolled back upon completion of execution.
es: Cada comando del script se ejecutará en una transacción indepediente, salvo que incluya entre ellos los comandos BEGIN, COMMIT y ROLLBACK, en cuyo caso lo hará de la forma esperada. A diferencia de otras herramientas, esta aplicación no reutiliza la conexión entre diferentes ejecuciones, lo que implica que no puede continuar una transacción iniciada en una ejecución anterior. Cualquier transacción que inicie, deberá confirmarla en el mismo texto o se revertirá automáticamente al completarse la ejecución.

source: Functions
es: Funciones

source: Indexes
es: Índices

source: source code
es: código fuente

# function_arguments
source: Arguments
es: Argumentos

# function_returns
source: Returns
es: Devuelve

# warning_run_selected_text
source: You have selected a portion of the text. If you continue, only that text will be executed and this message will not be displayed again.
es: Ha seleccionado una porción del texto. Si continúa, solo se ejecutará ese texto y este mensaje no se volverá a mostrar.

source: Run
es: Ejecutar

source: Copy text
es: Copiar texto

# import_databases
source: Import database list
es: Importar lista de bases de datos

# export_databases
source: Export database list
es: Exportar lista de bases de datos

source: Export password
es: Contraseña de exportación

# chk_export_passwords
source: Export database passwords
es: Exportar las contraseñas de las bases de datos

# chk_encrypt_passwords
source: Encrypt database passwords
es: Encriptar las contraseñas de las bases de datos

# export_ok
source: Export successful
es: Exportación correcta

# export_ok_msg
source: The configuration has been exported to the file: {0}
es: La configuración se ha exportado al fichero: {0}

# warning_dbalias_import_conflict
source: The file to import contains at least one database name that conflicts with one that already exists. Do you want to overwrite them?
es: El fichero a importar contiene al menos un nombre de base de datos que entra en conflicto con una que ya existe. ¿Desea sobreescribirlas?

# warning_bad_format_export_file
source: The file to import is not valid
es: El fichero a importar no es válido

# current_tab_last_task
source: Select last task of the active tab
es: Seleccionar última tarea de la solapa activa
